TestCase/30AOA-compression-coRner/SST_betaPrt/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    base
    {
        type            wall;
        inGroups        1(wall);
        nFaces          298;
        startFace       58607;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          59004;
        startFace       58905;
    }
    inlet
    {
        type            patch;
        nFaces          99;
        startFace       117909;
    }
    outlet
    {
        type            patch;
        nFaces          99;
        startFace       118008;
    }
    top
    {
        type            patch;
        nFaces          298;
        startFace       118107;
    }
)

// ************************************************************************* //
