TestCase/30AOA-compression-coRner/SST_betaPrt/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
simulationType  RAS;//laminar;//

RAS
{
    RASModel      kOmegaSST;// SpalartAllmaras;//kOmegaSST;//
    turbulence      on;
    betannmodel 1;
    Prtnnmodel 1;
    Main         9;
    betascalar   1;
    begin 0.1;
    printCoeffs     on;
}


// ************************************************************************* //
